{
  "saleProducts": [
    {
      "id": 29,
      "title": "Mesa de Jantar de Madeira Estilo Mid-Century Modern",
      "price": 24,
      "description": "Eleve sua sala de jantar com esta elegante mesa de jantar Mid-Century Modern, com acabamento em nogueira e pés afunilados para um visual atemporal. Sua construção robusta em madeira e design minimalista tornam-na uma peça versátil que combina com diversos estilos de decoração. Perfeita para jantares íntimos ou como um local estiloso para seu café da manhã.",
      "images": [
        "https://i.imgur.com/DMQHGA0.jpeg",
        "https://i.imgur.com/qrs9QBg.jpeg",
        "https://i.imgur.com/XVp8T1I.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 30,
      "title": "Mesa de Jantar com Base Dourada e Tampo de Pedra",
      "price": 66,
      "description": "Transforme seu espaço de jantar com esta mesa luxuosa, com base metálica dourada e design de hastes que oferece estabilidade e elegância. O tampo de pedra liso em formato redondo proporciona uma superfície robusta para suas refeições. Ideal para o dia a dia ou ocasiões especiais, combina facilmente com decorações modernas ou glamorosas.",
      "images": [
        "https://i.imgur.com/NWIJKUj.jpeg",
        "https://i.imgur.com/Jn1YSLk.jpeg",
        "https://i.imgur.com/VNZRvx5.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 31,
      "title": "Poltrona Modernidade Elegante Azul Petróleo",
      "price": 25,
      "description": "Renove sua sala com esta poltrona lindamente trabalhada, com estrutura de madeira e estofado azul petróleo vibrante. Ideal para dar um toque de cor e estilo contemporâneo a qualquer ambiente, oferece conforto e sofisticação. Perfeita para leitura, relaxamento ou criar um cantinho aconchegante.",
      "images": [
        "https://i.imgur.com/6wkyyIN.jpeg",
        "https://i.imgur.com/Ald3Rec.jpeg",
        "https://i.imgur.com/dIqo03c.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 32,
      "title": "Mesa de Jantar de Madeira Maciça Elegante",
      "price": 67,
      "description": "Melhore seu espaço de jantar com esta mesa de jantar contemporânea e elegante, feita de madeira maciça de alta qualidade com acabamento quente. Sua construção robusta e design minimalista a tornam uma adição perfeita para qualquer casa que busca um toque de elegância. Acomoda confortavelmente até seis convidados e inclui uma impressionante fruteira como peça central. A iluminação suspensa não está incluída.",
      "images": [
        "https://i.imgur.com/4lTaHfF.jpeg",
        "https://i.imgur.com/JktHE1C.jpeg",
        "https://i.imgur.com/cQeXQMi.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 33,
      "title": "Setup de Estação de Trabalho Minimalista Moderna",
      "price": 49,
      "description": "Eleve seu home office com nosso Setup de Estação de Trabalho Minimalista Moderna, com uma mesa de madeira elegante, um computador elegante, um abajur de mesa ajustável de madeira estiloso e acessórios complementares para um espaço de trabalho limpo e produtivo. Este setup é perfeito para profissionais que buscam um visual contemporâneo que combina funcionalidade com design.",
      "images": [
        "https://i.imgur.com/3oXNBst.jpeg",
        "https://i.imgur.com/ErYYZnT.jpeg",
        "https://i.imgur.com/boBPwYW.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 34,
      "title": "Cadeira de Escritório Ergonômica Moderna",
      "price": 71,
      "description": "Eleve seu espaço de escritório com esta cadeira de escritório ergonômica moderna, confortável e elegante. Projetada para fornecer suporte ideal durante todo o dia de trabalho, possui um mecanismo de ajuste de altura, rodízios suaves para fácil mobilidade e um assento acolchoado para conforto prolongado. As linhas limpas e o design minimalista branco a tornam uma adição versátil para qualquer espaço de trabalho contemporâneo.",
      "images": [
        "https://i.imgur.com/3dU0m72.jpeg",
        "https://i.imgur.com/zPU3EVa.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    },
    {
      "id": 35,
      "title": "Chuteiras Holográficas Futuristas",
      "price": 39,
      "description": "Entre em campo e se destaque da multidão com essas chuteiras holográficas chamativas. Projetadas para o jogador moderno, essas chuteiras apresentam um design elegante, construção leve para máxima agilidade e travas duráveis para tração ideal. O acabamento holográfico cintilante reflete um arco-íris de cores conforme você se move, garantindo que você seja notado tanto por suas habilidades quanto pelo estilo. Perfeitas para o atleta fashionista que quer fazer uma declaração.",
      "images": [
        "https://i.imgur.com/qNOjJje.jpeg",
        "https://i.imgur.com/NjfCFnu.jpeg",
        "https://i.imgur.com/eYtvXS1.jpeg"
      ],
      "category": {
        "id": 4,
        "name": "Sapatos",
        "image": "https://i.imgur.com/qNOjJje.jpeg"
      }
    },
    {
      "id": 36,
      "title": "Sapatos de Salto Alto com Glitter Arco-Íris",
      "price": 39,
      "description": "Entre no centro das atenções com esses sapatos de salto alto com glitter arco-íris chamativos. Projetados para deslumbrar, cada sapato exibe um caleidoscópio de cores cintilantes que captam e refletem a luz a cada passo. Perfeitos para ocasiões especiais ou uma noite fora, esses sapatos são garantidos para chamar a atenção e elevar qualquer conjunto.",
      "images": [
        "https://i.imgur.com/62gGzeF.jpeg",
        "https://i.imgur.com/5MoPuFM.jpeg",
        "https://i.imgur.com/sUVj7pK.jpeg"
      ],
      "category": {
        "id": 4,
        "name": "Sapatos",
        "image": "https://i.imgur.com/qNOjJje.jpeg"
      }
    },
    {
      "id": 37,
      "title": "Sandálias Espadrille de Verão em Denim",
      "price": 33,
      "description": "Entre no verão com estilo com nossas sandálias espadrille em denim. Com uma sola de juta trançada para um toque clássico e tiras ajustáveis de denim para um ajuste confortável, essas sandálias oferecem conforto e um toque de moda. O design fácil de calçar garante conveniência para dias de praia ou passeios casuais.",
      "images": [
        "https://i.imgur.com/9qrmE1b.jpeg",
        "https://i.imgur.com/wqKxBVH.jpeg",
        "https://i.imgur.com/sWSV6DK.jpeg"
      ],
      "category": {
        "id": 4,
        "name": "Sapatos",
        "image": "https://i.imgur.com/qNOjJje.jpeg"
      }
    },
    {
      "id": 38,
      "title": "Tênis Vibrantes: Laranja e Azul",
      "price": 27,
      "description": "Entre no estilo com esses tênis chamativos, com uma combinação impressionante de tons de laranja e azul. Projetados para conforto e moda, esses sapatos vêm com solas flexíveis e palmilhas acolchoadas, perfeitos para indivíduos ativos que não abrem mão do estilo. Os detalhes prateados reflexivos adicionam um toque de modernidade, tornando-os um acessório de destaque para seu treino ou uso casual.",
      "images": [
        "https://i.imgur.com/hKcMNJs.jpeg",
        "https://i.imgur.com/NYToymX.jpeg",
        "https://i.imgur.com/HiiapCt.jpeg"
      ],
      "category": {
        "id": 4,
        "name": "Sapatos",
        "image": "https://i.imgur.com/qNOjJje.jpeg"
      }
    }
  ],
  "products": [
    {
      "id": 7,
      "title": "Calça Jogger com Cordão de Conforto Clássico",
      "price": 79,
      "description": "Experimente a combinação perfeita de conforto e estilo com nossa Calça Jogger com Cordão de Conforto Clássico. Projetada para um ajuste relaxado, esta calça apresenta um tecido macio e elástico, bolsos laterais convenientes e um cós ajustável com detalhes elegantes em dourado. Ideal para relaxar ou fazer tarefas, esta calça rapidamente se tornará sua escolha para um visual casual e sem esforço.",
      "images": [
        "https://i.imgur.com/mp3rUty.jpeg",
        "https://i.imgur.com/JQRGIc2.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 8,
      "title": "Calça Jogger Vermelha Clássica",
      "price": 98,
      "description": "Experimente o conforto supremo com nossa calça jogger vermelha, perfeita tanto para sessões de treino quanto para relaxar em casa. Feita com tecido macio e durável, esta calça apresenta um cós confortável, cordão ajustável e bolsos laterais práticos para funcionalidade. Seu design afunilado e punhos elásticos oferecem um ajuste moderno que mantém você estiloso em movimento.",
      "images": [
        "https://i.imgur.com/9LFjwpI.jpeg",
        "https://i.imgur.com/vzrTgUR.jpeg",
        "https://i.imgur.com/p5NdI6n.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 9,
      "title": "Boné de Beisebol Azul Marinho Clássico",
      "price": 61,
      "description": "Saia com estilo com este boné de beisebol azul marinho elegante. Feito de material durável, apresenta um design liso e estruturado e uma alça ajustável para o ajuste perfeito. Proteja seus olhos do sol e complemente seus looks casuais com este acessório versátil e atemporal.",
      "images": [
        "https://i.imgur.com/R3iobJA.jpeg",
        "https://i.imgur.com/Wv2KTsf.jpeg",
        "https://i.imgur.com/76HAxcA.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 11,
      "title": "Boné de Beisebol Vermelho Clássico",
      "price": 35,
      "description": "Eleve seu guarda-roupa casual com este boné de beisebol vermelho atemporal. Feito de tecido durável, apresenta um ajuste confortável com uma alça ajustável na parte de trás, garantindo que um tamanho sirva para todos. Perfeito para dias ensolarados ou para adicionar um toque esportivo ao seu visual.",
      "images": [
        "https://i.imgur.com/cBuLvBi.jpeg",
        "https://i.imgur.com/N1GkCIR.jpeg",
        "https://i.imgur.com/kKc9A5p.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 12,
      "title": "Boné de Beisebol Preto Clássico",
      "price": 58,
      "description": "Eleve seu visual casual com este boné de beisebol preto atemporal. Feito com tecido respirável de alta qualidade, apresenta uma alça ajustável para o ajuste perfeito. Seja para uma corrida ou para fazer tarefas, este boné adiciona um toque de estilo a qualquer conjunto.",
      "images": [
        "https://i.imgur.com/KeqG6r4.jpeg",
        "https://i.imgur.com/xGQOw3p.jpeg",
        "https://i.imgur.com/oO5OUjb.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 13,
      "title": "Bermuda Chino Verde Oliva Clássica",
      "price": 84,
      "description": "Eleve seu guarda-roupa casual com esta bermuda chino verde oliva clássica. Projetada para conforto e versatilidade, apresenta um cós liso, bolsos práticos e um ajuste sob medida que a torna perfeita tanto para fins de semana relaxados quanto para ocasiões casuais elegantes. O tecido durável garante que ela resista às suas atividades diárias enquanto mantém um visual estiloso.",
      "images": [
        "https://i.imgur.com/UsFIvYs.jpeg",
        "https://i.imgur.com/YIq57b6.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 14,
      "title": "Shorts Atléticos de Cintura Alta Clássicos",
      "price": 43,
      "description": "Mantenha-se confortável e estiloso com nossos Shorts Atléticos de Cintura Alta Clássicos. Projetados para movimento e versatilidade ideais, esses shorts são indispensáveis para seu guarda-roupa de treino. Apresentando uma cintura alta que valoriza a figura, tecido respirável e um ajuste seguro que garante que eles permaneçam no lugar durante qualquer atividade, esses shorts são perfeitos para a academia, corrida ou até mesmo para uso casual.",
      "images": [
        "https://i.imgur.com/eGOUveI.jpeg",
        "https://i.imgur.com/UcsGO7E.jpeg",
        "https://i.imgur.com/NLn4e7S.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 15,
      "title": "Camiseta Branca Clássica",
      "price": 39,
      "description": "Eleve seus básicos com esta camiseta branca versátil. Feita de uma mistura de algodão macio e respirável, oferece conforto e durabilidade. Seu design elegante e atemporal garante que combine bem com praticamente qualquer conjunto. Ideal para sobreposição ou uso individual, esta camiseta é um item essencial para qualquer guarda-roupa.",
      "images": [
        "https://i.imgur.com/axsyGpD.jpeg",
        "https://i.imgur.com/T8oq9X2.jpeg",
        "https://i.imgur.com/J6MinJn.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 16,
      "title": "Camiseta Branca Clássica - Estilo e Conforto Atemporais",
      "price": 73,
      "description": "Eleve seu guarda-roupa diário com nossa Camiseta Branca Clássica. Feita de material de algodão premium macio, esta camiseta versátil combina conforto com durabilidade, perfeita para o uso diário. Apresentando um ajuste relaxado e unissex que valoriza todos os tipos de corpo, é uma peça essencial para qualquer conjunto casual. Fácil de cuidar e lavável à máquina, esta camiseta branca mantém sua forma e maciez lavagem após lavagem. Combine-a com seu jeans favorito ou use-a sob uma jaqueta para um visual elegante.",
      "images": [
        "https://i.imgur.com/Y54Bt8J.jpeg",
        "https://i.imgur.com/SZPDSgy.jpeg",
        "https://i.imgur.com/sJv4Xx0.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 17,
      "title": "Camiseta Preta Clássica",
      "price": 35,
      "description": "Eleve seu estilo diário com nossa Camiseta Preta Clássica. Esta peça essencial é feita de algodão macio e respirável para conforto o dia todo. Seu design versátil apresenta uma gola redonda clássica e mangas curtas, tornando-a perfeita para sobreposição ou uso individual. Durável e fácil de cuidar, certamente se tornará uma favorita em seu guarda-roupa.",
      "images": [
        "https://i.imgur.com/9DqEOV5.jpeg",
        "https://i.imgur.com/ae0AEYn.jpeg",
        "https://i.imgur.com/mZ4rUjj.jpeg"
      ],
      "category": {
        "id": 1,
        "name": "Roupas",
        "image": "https://i.imgur.com/QkIa5tT.jpeg"
      }
    },
    {
      "id": 18,
      "title": "Controlador de Jogos Sem Fio Branco e Laranja",
      "price": 69,
      "description": "Eleve sua experiência de jogo com este controlador sem fio de última geração, com uma base branca nítida e detalhes vibrantes em laranja. Projetado para jogos de precisão, a forma ergonômica e os botões responsivos proporcionam máximo conforto e controle para horas intermináveis de jogo. Compatível com várias plataformas de jogos, este controlador é indispensável para qualquer jogador sério que deseja melhorar seu setup.",
      "images": [
        "https://i.imgur.com/ZANVnHE.jpeg",
        "https://i.imgur.com/Ro5z6Tn.jpeg",
        "https://i.imgur.com/woA93Li.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 19,
      "title": "Conjunto de Fones de Ouvido Sem Fio e Fones de Ouvido com Fio",
      "price": 44,
      "description": "Experimente a fusão de estilo e som com este sofisticado conjunto de áudio, apresentando um par de fones de ouvido sem fio brancos elegantes que oferecem qualidade de som cristalina e conforto sobre a orelha. O conjunto também inclui um par de fones de ouvido duráveis, perfeitos para um estilo de vida em movimento. Eleve seu prazer musical com este duo versátil, projetado para atender a todas as suas necessidades de audição.",
      "images": [
        "https://i.imgur.com/yVeIeDa.jpeg",
        "https://i.imgur.com/jByJ4ih.jpeg",
        "https://i.imgur.com/KXj6Tpb.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 21,
      "title": "Torradeira Eficiente para 2 Fatias",
      "price": 48,
      "description": "Melhore sua rotina matinal com nossa torradeira elegante para 2 fatias, com controles de douramento ajustáveis e uma bandeja de migalhas removível para fácil limpeza. Este eletrodoméstico compacto e estiloso é perfeito para qualquer cozinha, garantindo que seu pão esteja sempre dourado e delicioso.",
      "images": [
        "https://i.imgur.com/keVCVIa.jpeg",
        "https://i.imgur.com/afHY7v2.jpeg",
        "https://i.imgur.com/yAOihUe.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 22,
      "title": "Mouse de Computador Sem Fio Moderno",
      "price": 10,
      "description": "Experimente navegação suave e precisa com este mouse sem fio moderno, com acabamento brilhante e design ergonômico confortável. Seu rastreamento responsivo e interface fácil de usar o tornam o acessório perfeito para qualquer configuração de desktop ou laptop. O tom azul estiloso adiciona um toque de cor ao seu espaço de trabalho, enquanto seu tamanho compacto garante que ele caiba perfeitamente em sua bolsa para produtividade em movimento.",
      "images": [
        "https://i.imgur.com/w3Y8NwQ.jpeg",
        "https://i.imgur.com/WJFOGIC.jpeg",
        "https://i.imgur.com/dV4Nklf.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 23,
      "title": "Laptop Moderno com Iluminação Ambiente",
      "price": 43,
      "description": "Experimente a computação de próxima geração com nosso laptop ultrafino, com uma tela deslumbrante iluminada por iluminação ambiente. Esta máquina de alto desempenho é perfeita tanto para trabalho quanto para lazer, oferecendo processamento poderoso em um design elegante e portátil. As cores vibrantes adicionam um toque de personalidade à sua coleção de tecnologia, tornando-o tão estiloso quanto funcional.",
      "images": [
        "https://i.imgur.com/OKn1KFI.jpeg",
        "https://i.imgur.com/G4f21Ai.jpeg",
        "https://i.imgur.com/Z9oKRVJ.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 24,
      "title": "Laptop Moderno para Profissionais",
      "price": 97,
      "description": "Experimente tecnologia de ponta e design elegante com nosso modelo de laptop mais recente. Perfeito para profissionais em movimento, este laptop de alto desempenho possui um processador poderoso, amplo armazenamento e uma longa duração de bateria, tudo em um quadro leve e fino para máxima portabilidade. Compre agora para elevar seu trabalho e lazer.",
      "images": [
        "https://i.imgur.com/ItHcq7o.jpeg",
        "https://i.imgur.com/55GM3XZ.jpeg",
        "https://i.imgur.com/tcNJxoW.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 25,
      "title": "Fones de Ouvido Over-Ear Vermelhos e Prateados Estilosos",
      "price": 39,
      "description": "Mergulhe em qualidade de som superior com esses fones de ouvido over-ear vermelhos e prateados elegantes. Projetados para conforto e estilo, os fones de ouvido apresentam almofadas acolchoadas, uma faixa de cabeça ajustável e acolchoada e um cabo vermelho destacável para fácil armazenamento e portabilidade. Perfeitos para amantes da música e audiófilos que valorizam tanto a aparência quanto a fidelidade de áudio.",
      "images": [
        "https://i.imgur.com/YaSqa06.jpeg",
        "https://i.imgur.com/isQAliJ.jpeg",
        "https://i.imgur.com/5B8UQfh.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 26,
      "title": "Capa de Telefone com Acabamento Espelhado",
      "price": 27,
      "description": "Melhore a aparência do seu smartphone com esta capa de telefone com acabamento espelhado ultraelegante. Projetada para oferecer estilo com proteção, a capa apresenta uma superfície reflexiva que adiciona um toque de elegância enquanto mantém seu dispositivo seguro contra arranhões e impactos. Perfeita para quem ama uma estética minimalista e moderna.",
      "images": [
        "https://i.imgur.com/yb9UQKL.jpeg",
        "https://i.imgur.com/m2owtQG.jpeg",
        "https://i.imgur.com/bNiORct.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 27,
      "title": "Smartwatch Moderno com Display Vibrante",
      "price": 16,
      "description": "Experimente a cronometragem moderna com nosso smartwatch de alta tecnologia, com uma tela sensível ao toque vívida, mostradores de relógio personalizáveis e uma pulseira de silicone azul confortável. Este smartwatch mantém você conectado com notificações e rastreamento de condicionamento físico enquanto exibe estilo e versatilidade excepcionais.",
      "images": [
        "https://i.imgur.com/LGk9Jn2.jpeg",
        "https://i.imgur.com/1ttYWaI.jpeg",
        "https://i.imgur.com/sPRWnJH.jpeg"
      ],
      "category": {
        "id": 2,
        "name": "Eletrônicos",
        "image": "https://i.imgur.com/ZANVnHE.jpeg"
      }
    },
    {
      "id": 28,
      "title": "Sofá de Couro Moderno e Elegante",
      "price": 53,
      "description": "Melhore a elegância do seu espaço de convivência com nosso Sofá de Couro Moderno e Elegante. Projetado com uma estética minimalista, apresenta linhas limpas e um acabamento em couro luxuoso. As pernas de metal robustas proporcionam estabilidade e suporte, enquanto as almofadas macias garantem conforto. Perfeito para casas contemporâneas ou áreas de espera de escritórios, este sofá é uma peça de destaque que combina estilo com praticidade.",
      "images": [
        "https://i.imgur.com/Qphac99.jpeg",
        "https://i.imgur.com/dJjpEgG.jpeg",
        "https://i.imgur.com/MxJyADq.jpeg"
      ],
      "category": {
        "id": 3,
        "name": "Móveis",
        "image": "https://i.imgur.com/Qphac99.jpeg"
      }
    }
  ],
  "categories": [
    {
      "id": 1,
      "name": "Roupas",
      "image": "https://i.imgur.com/QkIa5tT.jpeg"
    },
    {
      "id": 2,
      "name": "Eletrônicos",
      "image": "https://i.imgur.com/ZANVnHE.jpeg"
    },
    {
      "id": 3,
      "name": "Móveis",
      "image": "https://i.imgur.com/Qphac99.jpeg"
    },
    {
      "id": 4,
      "name": "Sapatos",
      "image": "https://i.imgur.com/qNOjJje.jpeg"
    },
    {
      "id": 5,
      "name": "Joias",
      "image": "https://pngimagesfree.com/wp-content/uploads/Gold-Jewellery-Necklaces-PNG@.png"
    },
    {
      "id": 6,
      "name": "Diversos",
      "image": "https://i.imgur.com/BG8J0Fj.jpg"
    }
  ],
  "cart": [
    {
      "id": 1,
      "title": "Camiseta Branca Clássica",
      "price": 20,
      "quantity": 1,
      "image": "https://i.imgur.com/axsyGpD.jpeg"
    },
    {
      "id": 2,
      "title": "Mouse de Computador Sem Fio Moderno",
      "price": 10,
      "quantity": 1,
      "image": "https://i.imgur.com/w3Y8NwQ.jpeg"
    },
    {
      "id": 3,
      "title": "Smartwatch Moderno com Display Vibrante",
      "price": 16,
      "quantity": 1,
      "image":  "https://i.imgur.com/LGk9Jn2.jpeg"
    }
  ],
  "notifications": [
    {
      "id": 1,
      "title": "Pedido Realizado",
      "message": "Seu pedido foi realizado com sucesso.",
      "timestamp": "3 horas atrás"
    },
    {
      "id": 2,
      "title": "Pagamento Recebido",  
      "message": "Seu pagamento foi recebido com sucesso.",  
      "timestamp": "4 horas atrás"
    },
    {
      "id": 3,
      "title": "Pedido Entregue",
      "message": "Seu pedido foi entregue com sucesso.",
      "timestamp": "2 dias atrás"
    },
    {
      "id": 4,
      "title": "Pedido Cancelado",
      "message": "Seu pedido foi cancelado com sucesso.",
      "timestamp": "5 dias atrás"
    }
  ]
}
